In [67]:
import pandas as pd
import numpy as np
%matplotlib inline

In [4]:
cities="Delhi Ambala Chandigarh Mumbai Banglor".split()
temp=[42,40,34,41,36]

In [5]:
cities

['Delhi', 'Ambala', 'Chandigarh', 'Mumbai', 'Banglor']

In [6]:
temp

[42, 40, 34, 41, 36]

In [7]:
ser=pd.Series(temp,cities)

In [8]:
ser

Delhi         42
Ambala        40
Chandigarh    34
Mumbai        41
Banglor       36
dtype: int64

In [11]:
ser['Ambala']

40

ser[2]

In [14]:
ser.iloc[2]

34

In [16]:
ser[ser>38]

Delhi     42
Ambala    40
Mumbai    41
dtype: int64

In [17]:
ser.abs

<bound method NDFrame.abs of Delhi         42
Ambala        40
Chandigarh    34
Mumbai        41
Banglor       36
dtype: int64>

In [18]:
ser.add

<bound method _flex_method_SERIES.<locals>.flex_wrapper of Delhi         42
Ambala        40
Chandigarh    34
Mumbai        41
Banglor       36
dtype: int64>

In [ ]:
ser.apply

In [27]:
li=[[1,2,3,4,54,"Hello"],[5,6,7,8,9,10],[11,12,13,14,15,16]]
col="a b c d e f".split()
label="x y z".split()

In [29]:
df=pd.DataFrame(data=li,index=label,columns=col)

In [30]:
df

    a   b   c   d   e      f
x   1   2   3   4  54  Hello
y   5   6   7   8   9     10
z  11  12  13  14  15     16

In [45]:
dic={"R":"45 56 328".split(),
     "B":"40 89 31".split(),
     "Y": "56 78 90".split()}
color="c1 c2 c3".split()

In [57]:
df2=pd.DataFrame(dic,index=color,dtype=int)
df2.dtypes

R    int32
B    int32
Y    int32
dtype: object

In [58]:
df2

      R   B   Y
c1   45  40  56
c2   56  89  78
c3  328  31  90

In [55]:
df2[['B',"R"]].iloc[2]

B     31
R    328
Name: c3, dtype: object

In [59]:
df2>45

        R      B     Y
c1  False  False  True
c2   True   True  True
c3   True  False  True

In [61]:
df2[df2>45]

        R     B   Y
c1    NaN   NaN  56
c2   56.0  89.0  78
c3  328.0   NaN  90

In [62]:
df2.dropna()

      R   B   Y
c1   45  40  56
c2   56  89  78
c3  328  31  90

In [63]:
df2

      R   B   Y
c1   45  40  56
c2   56  89  78
c3  328  31  90

In [64]:
df2[df2>45].dropna()

       R     B   Y
c2  56.0  89.0  78

In [65]:
df2[df2>45].drop(["R","B"],axis=1)

     Y
c1  56
c2  78
c3  90

In [ ]:
df2.plot.Bar(x="B",y="R")